app/controllers/shops_controller.rb

INSERT INTO "shops" ("address", "branch", "created_at", "industry", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "hello2"], ["branch", 4], ["created_at", "2014-08-05 09:18:54.945615"], ["industry", "rashguard"], ["name", "hello"], ["updated_at", "2014-08-05 09:18:54.945615"]]
---
  def create
    @shop = Shop.new(shop_params)

    respond_to do |format|
      if @shop.save

UPDATE "shops" SET "industry" = ?, "updated_at" = ? WHERE "shops"."id" = 2  [["industry", "clothes666"], ["updated_at", "2014-08-05 09:19:29.838783"]]
---
  def update
    respond_to do |format|
      if @shop.update(shop_params)

SELECT  "shops".* FROM "shops"  WHERE "shops"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_shop
      @shop = Shop.find(params[:id])