app/controllers/wholesales_controller.rb

SELECT "wholesales".* FROM "wholesales"
---
  def index
    @wholesales = Wholesale.all

INSERT INTO "wholesales" ("address", "created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "hollywood3"], ["created_at", "2014-08-05 09:31:11.645829"], ["email", "ikea@hotmail.com"], ["name", "Ikea"], ["phone", 5555555], ["updated_at", "2014-08-05 09:31:11.645829"]]
---
  def create
    @wholesale = Wholesale.new(wholesale_params)

    respond_to do |format|
      if @wholesale.save

SELECT  "wholesales".* FROM "wholesales"  WHERE "wholesales"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_wholesale
      @wholesale = Wholesale.find(params[:id])